# GetCurveUV Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Edge..::..GetCurveUV Method (Int32)
Edge Class See Also
---
Calculate a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public CurveUV GetCurveUV(
	int index
)
```

Visual Basic
---
```text
Public Function GetCurveUV ( _
	index As Integer _
) As CurveUV
```

Visual C++
---
```text
public:
CurveUV^ GetCurveUV(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32The index of the face (0 or 1).
# ### Return Value
If successful, returns the calculated CurveUV, nullNothingnullptra null reference (Nothing in Visual Basic) otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the specified index is not 0 or 1. |

# See Also
Edge Class
GetCurveUV Overload
Autodesk.Revit.DB Namespace